OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  return true;
}

// -------------------------------------------------------------------
// Helper function to detect positive string
// -------------------------------------------------------------------
bool isPositive(const String &str) {
  return str == "1" || str == "true";
}

bool isPositive(MongooseHttpServerRequest *request, const char *param) {
  char paramValue[8];
  int paramFound = request->getParam(param, paramValue, sizeof(paramValue));
  return paramFound >= 0 && (0 == paramFound || isPositive(String(paramValue)));
}

//---------------------------------------------------------------------
// Build status data
// --------------------------------------------------------------------

void buildStatus(DynamicJsonDocument &doc) {

  // Get the current time
  struct timeval local_time;
  gettimeofday(&local_time, NULL);

  struct tm * timeinfo = gmtime(&local_time.tv_sec);

  char time[64];
  char offset[8];
  strftime(time, sizeof(time), "%FT%TZ", timeinfo);
  strftime(offset, sizeof(offset), "%z", timeinfo);

  if (net.isWiredConnected()) {
    doc["mode"] = "Wired";
  } else if (net.isWifiModeStaOnly()) {
    doc["mode"] = "STA";
  } else if (net.isWifiModeApOnly()) {
    doc["mode"] = "AP";
  } else if (net.isWifiModeAp() && net.isWifiModeSta()) {
    doc["mode"] = "STA+AP";
  }

  doc["wifi_client_connected"] = (int)net.isWifiClientConnected();
  doc["eth_connected"] = (int)net.isWiredConnected();
  doc["net_connected"] = (int)net.isWifiClientConnected();
  doc["ipaddress"] = net.getIp();
  doc["ipv6address"] = net.getIpv6();
  doc["macaddress"] = net.getMac();

  doc["emoncms_connected"] = (int)emoncms_connected;
  doc["packets_sent"] = packets_sent;
  doc["packets_success"] = packets_success;

  doc["mqtt_connected"] = (int)mqtt.isConnected();
  doc["mqtt_status"]    = mqtt.getMqttStatus();
  if (mqtt.getBrokerIp()[0] != '\0')
    doc["mqtt_broker_ip"]      = mqtt.getBrokerIp();
  if (mqtt.getBrokerVersion()[0] != '\0')
    doc["mqtt_broker_version"] = mqtt.getBrokerVersion();
  if (mqtt.getConnectedSince() > 0)
    doc["mqtt_connected_since"] = (uint32_t)mqtt.getConnectedSince();
  if (mqtt.getLastRxTime() > 0)
    doc["mqtt_last_rx"]         = (uint32_t)mqtt.getLastRxTime();
  if (mqtt.getErrorCategory()[0] != '\0') {
    doc["mqtt_error"]        = mqtt.getErrorCategory();
    doc["mqtt_error_detail"] = mqtt.getErrorDetail();
  }

  doc["ocpp_connected"] = (int)OcppTask::isConnected();

#if defined(ENABLE_PN532) || defined(ENABLE_RFID)
  doc["rfid_failure"] = (int) rfid.communicationFails();
  doc["rfid_reader"] = (int) rfid.readerPresent();
#endif

  doc["ohm_hour"] = ohm_hour;

  doc["free_heap"] = ESPAL.getFreeHeap();
  doc["littlefs_free"] = (uint32_t)(LittleFS.totalBytes() - LittleFS.usedBytes());
  doc["littlefs_used"] = (uint32_t)LittleFS.usedBytes();

  doc["comm_sent"] = rapiSender.getSent();
  doc["comm_success"] = rapiSender.getSuccess();
  doc["rapi_connected"] = (int)rapiSender.isConnected();
  doc["evse_connected"] = (int)evse.isConnected();

  create_rapi_json(doc);

  doc["gfcicount"] = evse.getFaultCountGFCI();
  doc["nogndcount"] = evse.getFaultCountNoGround();
  doc["stuckcount"] = evse.getFaultCountStuckRelay();

  doc["solar"] = divert.getSolar();
  doc["grid_ie"] = divert.getGridIe();
  doc["charge_rate"] = divert.getChargeRate();
  doc["divert_update"] = (millis() - divert.getLastUpdate()) / 1000;
  doc["divert_active"] = divert.isActive();
  doc["shaper"] = shaper.getState()?1:0;
  doc["shaper_live_pwr"] = shaper.getLivePwr();
  // doc["shaper_cur"] = shaper.getChgCur();
  doc["shaper_cur"] = shaper.getMaxCur();
  doc["shaper_updated"] = shaper.isUpdated();
  doc["service_level"] = static_cast<uint8_t>(evse.getActualServiceLevel());
  doc["limit"] = limit.hasLimit();

  doc["ota_update"] = (int)Update.isRunning();

  doc["config_version"] = config_version();
  doc["loadsharing_min_current"] = evse.getMinCurrent();
  doc["loadsharing_max_current"] = evse.getMaxConfiguredCurrent();
  doc["loadsharing_priority"] = loadsharing_priority;
  doc["loadsharing_peers_version"] = loadsharing_peers_version;
  doc["loadsharing_status_version"] = loadsharing_status_version;

  // Add joined peers array with real-time status from peer poller
  {
    JsonArray peersArray = doc.createNestedArray("loadsharing_joined_peers");
    double groupTotalAmp = 0.0;
    
    for (const auto& peer : loadSharingGroupState.getPeers()) {
      // Only include joined peers (exclude discovered-but-not-joined)
      if (!peer.isJoined()) {
        continue;
      }
      
      JsonObject peerObj = peersArray.createNestedObject();
      peerObj["hostname"] = peer.getHost();
      peerObj["id"] = peer.getId();
      peerObj["name"] = peer.getName();
      
      // Get real-time status from peer poller
      LoadSharingPeerStatus peerStatus;
      if (loadSharingPeerPoller.getPeerStatus(peer.getHost(), peerStatus)) {
        peerObj["amp"] = peerStatus.getAmp();
        peerObj["voltage"] = peerStatus.getVoltage();
        peerObj["pilot"] = peerStatus.getPilot();
        peerObj["vehicle"] = peerStatus.getVehicle();
        peerObj["state"] = peerStatus.getState();
        peerObj["min_current"] = peerStatus.getMinCurrent();
        peerObj["max_current"] = peerStatus.getMaxCurrent();
        peerObj["priority"] = peerStatus.getPriority();
        groupTotalAmp += peerStatus.getAmp();
      }
    }
    
    // Include self in group total
    groupTotalAmp += evse.getChargeCurrent();
    doc["loadsharing_group_current_total"] = groupTotalAmp;
  }

  doc["claims_version"] = evse.getClaimsVersion();
  doc["override_version"] = manual.getVersion();
  doc["schedule_version"] = scheduler.getVersion();
  doc["schedule_plan_version"] = scheduler.getPlanVersion();
  doc["limit_version"] = limit.getVersion();

  doc["vehicle_state_update"] = (millis() - evse.getVehicleLastUpdated()) / 1000;
  if(teslaClient.getVehicleCnt() > 0) {
    doc["tesla_vehicle_count"] = teslaClient.getVehicleCnt();
    doc["tesla_vehicle_id"] = teslaClient.getVehicleId(teslaClient.getCurVehicleIdx());
    doc["tesla_vehicle_name"] = teslaClient.getVehicleDisplayName(teslaClient.getCurVehicleIdx());
    teslaClient.getChargeInfoJson(doc);
  } else {
    doc["tesla_vehicle_count"] = false;
    doc["tesla_vehicle_id"] = false;
    doc["tesla_vehicle_name"] = false;
    if(evse.isVehicleStateOfChargeValid()) {
      doc["battery_level"] = evse.getVehicleStateOfCharge();
    }
    if(evse.isVehicleRangeValid()) {
      doc["battery_range"] = evse.getVehicleRange();
    }
    if(evse.isVehicleEtaValid()) {
      doc["time_to_full_charge"] = evse.getVehicleEta();
    }
    if(evse.isVehicleChargeLimitValid()) {
      doc["vehicle_charge_limit"] = evse.getVehicleChargeLimit();
    }
  }

#ifdef ENABLE_TSDB
  doc["tsdb_ready"] = tsdbEnergyLogger.isReady() ? 1 : 0;
  doc["tsdb_err"]   = tsdbEnergyLogger.initError();
#endif
  home_battery_add_status_fields(doc);

  DBUGF("/status ArduinoJson size: %dbytes", doc.size());
}

// -------------------------------------------------------------------
// Wifi scan
// url: /scan
// -------------------------------------------------------------------
void
handleScan(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_JSON)) {
    return;
  }

