OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
    }
    else {
      response->setCode(500);
      response->print("{\"msg\":\"Reset Failed\"}");
    }
  }
  else {
    response->setCode(500);
    response->print("{\"msg\":\"reset Failed\"}");
  }
}

void handleEmeter(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if (false == requestPreProcess(request, response))
  {
    return;
  }

  if (HTTP_DELETE == request->method())
  {
    handleEmeterDelete(request, response);
  }
  else
  {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }

  request->send(response);
}



  //----------------------------------------------------------

  void handleOverrideGet(MongooseHttpServerRequest * request, MongooseHttpServerResponseStream * response)
  {
    if (manual.isActive())
    {
      EvseProperties props;
      manual.getProperties(props);
      props.serialize(response);
    } else {
    response->setCode(200);
    response->print("{}");
  }
}

void handleOverridePost(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  String body = request->body().toString();

  EvseProperties props;
  if(props.deserialize(body))
  {
    if(manual.claim(props)) {
      response->setCode(201);
      response->print("{\"msg\":\"Created\"}");
      mqtt.publishOverride();  // update override state to mqtt
    } else {
      response->setCode(500);
      response->print("{\"msg\":\"Failed to claim manual override\"}");
    }
  } else {
    response->setCode(400);
    response->print("{\"msg\":\"Failed to parse JSON\"}");
  }
}

void handleOverrideDelete(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  if(manual.release()) {
    response->setCode(200);
    response->print("{\"msg\":\"Deleted\"}");
    mqtt.publishOverride();  // update override state to mqtt
  } else {
    response->setCode(500);
    response->print("{\"msg\":\"Failed to release manual override\"}");
  }
}

void handleOverridePatch(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  if(manual.toggle())
  {
    response->setCode(200);
    response->print("{\"msg\":\"Updated\"}");
    mqtt.publishOverride();  // update override state to mqtt
  } else {
    response->setCode(500);
    response->print("{\"msg\":\"Failed to toggle manual override\"}");
  }
}

void
handleOverride(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  if(HTTP_GET == request->method()) {
    handleOverrideGet(request, response);
  } else if(HTTP_POST == request->method()) {
    handleOverridePost(request, response);
  } else if(HTTP_DELETE == request->method()) {
    handleOverrideDelete(request, response);
  } else if(HTTP_PATCH == request->method()) {
    handleOverridePatch(request, response);
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }

  request->send(response);
}

// -------------------------------------------------------------------
// Reset config and reboot
// url: /reset
// -------------------------------------------------------------------
void
handleRst(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  config_reset();
  ESPAL.eraseConfig();

  response->setCode(200);
  response->print("1");
  request->send(response);

  restart_system();
}


// -------------------------------------------------------------------
// Restart (Reboot gateway or evse)
// url: /restart
// -------------------------------------------------------------------
void
handleRestart(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  if (HTTP_GET == request->method()) {
    response->setCode(200);
    response->print("1");
    request->send(response);
    restart_system();
  }
  else if (HTTP_POST == request->method()) {
    String body = request->body().toString();
    // Deserialize the JSON document
    const size_t capacity = JSON_OBJECT_SIZE(1) + 16;
    DynamicJsonDocument doc(capacity);
    DeserializationError error = deserializeJson(doc, body);
    if(!error)
    {
      if(doc.containsKey("device")){
        if (strcmp(doc["device"], "gateway") == 0 ) {
          response->setCode(200);
          response->print("{\"msg\":\"restart gateway\"}");
          request->send(response);
          restart_system();
        }
        else if (strcmp(doc["device"], "evse") == 0) {
          response->setCode(200);
          response->print("{\"msg\":\"restart evse\"}");
          request->send(response);
          evse.restartEvse();
        }
        else {
          response->setCode(404);
          response->print("{\"msg\":\"unknown device\"}");
          request->send(response);
        }
      }
      else {
        response->setCode(400);
        response->print("{\"msg\":\"wrong payload\"}");
        request->send(response);
      }
    } else {
      response->setCode(400);
      response->print("{\"msg\":\"Couldn't parse json\"}");
      request->send(response);
    }
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
    request->send(response);
  }
}

// -------------------------------------------------------------------
// Emoncms describe end point,
// Allows local device discover using https://github.com/emoncms/find
// url: //emoncms/describe
// -------------------------------------------------------------------
void handleDescribe(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseBasic *response = request->beginResponse();
  response->setCode(200);
  response->setContentType(CONTENT_TYPE_TEXT);
  response->addHeader("Access-Control-Allow-Origin", "*");
  response->setContent("openevse");
  request->send(response);
}

